{ "jdid": 1,
   "jobTitle": "Senior Software Engineer",
   "about": "Chargebee has a long history of driving growth by embracing innovation and new ways of thinking. Through Digital BCG, we bring together a diverse mix of consultants and digital specialists to ensure that we are supporting our clients throughout their digital transformation journeys. We work with our clients to fully understand the impact of digital on their business and set priorities that will transform their vision into value. Whether it be developing new technologies to support their core business, making better use of their data, or pursuing entirely new sources of revenue, our aim is to achieve radical improvements in productivity, flexibility, and speed. We are innovating how our clients use artificial intelligence, robotic process automation, the internet of things, personalization, blockchain technologies, and more to gain a competitive advantage. ",
   "jobSummary": "Engineering Managers in the Chargebee Platform team are expected to provide technical expertise and leadership in creating true distributed cloud platform & frameworks that solve problems for all our customers - internal or external.In this role, you will own the solution space from concept design to deployment for complex problems while simplifying the user experience.",
   "rolesandResponsiblities": "Be the guide who walks with the team, not the one who only gives them directions.Consistently deliver value to customers in an aggressive, start-up paced environment.Leverage technical knowledge and domain expertise to collaborate with architects and individual contributors. Own performance, stability, and resiliency of the code delivered by the team. Build a distributed platform framework that enables complex solutions to be developed and deployed at cloud-scale. Define clear goals. Plan and execute effectively in rapidly evolving situations.",
   "mustHaveSkills": "A “Can Do” attitude.Technically hands-on in systems architecture, design, coding, and testing.Experience in managing teams delivering cloud-scale solutions.Adept at agile management practices. ",
   "nicetohaveSkills": "Experience of cloud technologies - AWS preferred, IAM, API design, Data Modeling.",
   "experience": 1 
}